Documents/ОтражениеЗарплатыВБухучете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеЗарплатыВБухучете</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныйТипЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТипЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныйТипЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Documents/ОтражениеЗарплатыВБухучете/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		
		// Один запрос, который сразу суммирует все начисления
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Сотрудник,
		|	СУММА(Начисления.Результат) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Сотрудник,
		|		ОсновныеНачисления.Результат
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
		|	ГДЕ
		|		ОсновныеНачисления.Регистратор = &Регистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДополнительныеНачисления.Сотрудник,
		|		ДополнительныеНачисления.Результат
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|	ГДЕ
		|		ДополнительныеНачисления.Регистратор = &Регистратор) КАК Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник";
		
		Запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);
		Результат = Запрос.Выполнить();
		
		// Очищаем и заполняем табличную часть
		ЭтотОбъект.Сотрудники.Очистить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Сотрудники.Добавить();
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.Сумма = Выборка.Сумма;
		КонецЦикла;
		
	КонецЕсли;КонецПроцедуры

	Процедура ОбработкаПроведения(Отказ, Режим)
		//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

		// регистр Хозрасчетный 
		Движения.Хозрасчетный.Записывать = Истина;
		Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.СтатьиЗатрат;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.Сотрудники;
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаСотрудники.Сумма;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетный.СтатьиЗатрат] = СтатьяЗатрат;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетный.Сотрудник] = ТекСтрокаСотрудники.Сотрудник;
		КонецЦикла;

		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры
